Catalogs/ОснованияУвольненияПользовательские.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОснованияУвольненияПользовательские</Name>
			<Comment>АПК:413 ОбработкаПолученияДанныхВыбора только для представления, допустима история выбора при вводе </Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ОснованияУвольнения</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НормативныеДокументыОснованийКадровыхПриказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокументаОснованияВРодительномПадеже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОснованияУвольнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОснованияУвольнения</Name>
			<Comment>АПК:413 ОбработкаПолученияДанныхВыбора только для представления, допустима история выбора при вводе </Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НормативныеДокументыОснованийКадровыхПриказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОснованияУвольненияПользовательские/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И Метаданные.ОпределяемыеТипы.ОснованиеУвольнения.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОснованияУвольнения.Наименование КАК Наименование,
			|	ОснованияУвольнения.ТекстОснования КАК ТекстОснования,
			|	ОснованияУвольнения.Статья КАК Статья,
			|	ОснованияУвольнения.Часть КАК Часть,
			|	ОснованияУвольнения.Пункт КАК Пункт,
			|	ОснованияУвольнения.Подпункт КАК Подпункт,
			|	ОснованияУвольнения.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения
			|ГДЕ
			|	ОснованияУвольнения.Ссылка = &Ссылка";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ОснованияУвольнения",
			ДанныеЗаполнения.Метаданные().ПолноеИмя());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если Не ЗначениеЗаполнено(НаименованиеДокументаОснования)
			И ЗначениеЗаполнено(НаименованиеДокументаОснованияВРодительномПадеже)Тогда
			
			ТекстСообщения = НСтр("ru = 'Поле ""Наименование документа основания"" не заполнено'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
				"НаименованиеДокументаОснования", "Объект", Отказ);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаименованиеДокументаОснованияВРодительномПадеже)
			И ЗначениеЗаполнено(НаименованиеДокументаОснования) Тогда
			
			ТекстСообщения = НСтр("ru = 'Поле ""Наименование документа основания (в родительном падеже)"" не заполнено'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
				"НаименованиеДокументаОснованияВРодительномПадеже", "Объект", Отказ);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаименованиеДокументаОснования)
			И Не ЗначениеЗаполнено(НаименованиеДокументаОснованияВРодительномПадеже) Тогда
			
			ТекстСообщения = НСтр("ru = 'Поле ""Документ основание"" не заполнено'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
				"Объект.ДокументОснование", "", Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статья)
		И Не ЗначениеЗаполнено(Часть)
		И Не ЗначениеЗаполнено(Пункт)
		И Не ЗначениеЗаполнено(Подпункт) Тогда
		
		ТекстСообщения = НСтр("ru = 'Поля номера текста основания в нормативном документе не заполнены'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Статья", "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
